# Data Preprocessing for Algorithm Design
## Art Museum

In [113]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

### Read the data

In [114]:
collections = pd.read_csv('originaldata/collections.csv', sep=",", encoding="utf-8")
collections.head()

,CollectionID,CollectionName,CollDescription,NumObjects
0,1,Textiles and Furniture ...,NaN,0
1,2,Southeast Asia ...,NaN,264
2,3,South Arabia,NaN,62
3,4,Roman Empire ...,<p>The Walters&rsquo; collection contains one ...,436
4,5,Renaissance Europe ...,<p>The Walters' collection of European Renaiss...,1021

In [115]:
exhibitions = pd.read_csv('originaldata/exhibitions.csv', sep=",", encoding="utf-8")
exhibitions.head()

,ExhibitionID,ExhTitle,NonWAMExhibition,ExhibitionDisplayDate,ExhibBeginDate,ExhibEndDate,ExhibBeginYear,ExhibEndYear,Textblock,LocationID,WaltersArtworks
0,3628,Léon Bonvin (1834-1866),True,2022-2023,NaN,NaN,2022.0,2023.0,"Léon Bonvin (1834-1866). Fondation Custodia, P...",NaN,"13074, 13074, 13074, 13074, 13074, 13074, 1307..."
1,3696,"Sargent, Whistler, and Venetian Glass: America...",True,2021-2023,NaN,NaN,2021.0,2023.0,"Sargent, Whistler, and Venetian Glass: America...",NaN,"26856, 26856, 26856, 6053, 6053, 6053, 19004, ..."
2,3735,Hugo van der Goes,True,2021-2023,NaN,NaN,2021.0,2023.0,"Hugo van der Goes. Gemaldegalerie, Berlin. 202...",NaN,26514
3,3786,Quiet Beauty: The Watercolors of Léon Bonvin,False,2023,NaN,NaN,2023.0,2023.0,Quiet Beauty: The Watercolors of Léon Bonvin. ...,NaN,"13987, 13987, 13987, 13987, 17483, 17483, 1748..."
4,3581,"Caravans of Gold, Fragments in Time: Art, Cult...",True,2019-2022,NaN,NaN,2019.0,2022.0,"Caravans of Gold, Fragments in Time: Art, Cult...",NaN,"21724, 21724, 21724, 21724, 21724, 21724, 2055..."

In [116]:
creators = pd.read_csv('originaldata/creators.csv', sep=",", encoding="utf-8")
creators.head()

,id,sort_name,name,CreatorURL,gender,biography,date,CreatorArt
0,6741,"'Abbasi, Riza",Riza 'Abbasi,https://art.thewalters.org/browse/creator/riza...,NaN,NaN,"(Persian, ca. 1565-1635)","37361, 34627, 33104, 26833, 25935, 9485, 4103,..."
1,4237,"'Abbasi, Shaykh",Shaykh 'Abbasi,https://art.thewalters.org/browse/creator/shay...,NaN,NaN,"(Persian, active 1650-1684)","33104, 25935, 19347, 987, 7066, 84294, 84260"
2,19270,"'Abd al-Razzaq, Abu Mansur Muhammad ibn",Abu Mansur Muhammad ibn 'Abd al-Razzaq,https://art.thewalters.org/browse/creator/abu-...,NaN,NaN,NaN,"7066, 83514"
3,19395,'Ali,'Ali,https://art.thewalters.org/browse/creator/ali,NaN,NaN,NaN,"19840, 90954, 90955"
4,16856,'Ali Sultan,Sultan 'Ali,https://art.thewalters.org/browse/creator/sult...,NaN,NaN,NaN,"82840, 80051, 11787, 90218"

In [117]:
artworks = pd.read_csv('originaldata/art.csv', sep=",", encoding="utf-8")
artworks.head()

/var/folders/0z/1mvz8s_117dflxm7ygn_015w0000gn/T/ipykernel_4021/3515539729.py:1: DtypeWarning: Columns (13) have mixed types. Specify dtype option on import or set low_memory=False.
  artworks = pd.read_csv('originaldata/art.csv', sep=",", encoding="utf-8")

,ObjectID,ObjectNumber,SortNumber,ObjectName,DateBeginYear,DateEndYear,DateText,Title,Dimensions,Medium,...,LatitudeNumber,LongitudeNumber,RelatedObjects,Images,CollectionID,CollectionName,MuseumLocation,LocationString,Creators,Exhibitions
0,7,54.975,54.975,statuettes (statues),-425,-400,late 5th century BCE (Classical),Zeus,H: 13 7/8 in. (35.3 cm),bronze,...,NaN,NaN,NaN,"PS1_54.975_Back_DD_T08.jpg, PS1_54.975_Fnt_DD_...",ROM,Ancient Art,To find out whether this object is currently o...,NaN,"6291, 3705",NaN
1,11,42.188,42.188,finger rings; beads; plaques (flat objects),-1479,-1185,"1479-1185 BCE (New Kingdom, Dynasty 18-19)",Unfinished Ring with Flat Bead,H: 3/8 x W: 1/2 (0.99 x 1.33 x 0.04 cm); Ring ...,carved yellow jasper and gold,...,NaN,NaN,NaN,"CUR_42.188_SideA_DD_RS2009.jpg, CUR_42.188_Top...","EGY, JWL",Ancient Art,To find out whether this object is currently o...,NaN,6182,2513
2,14,42.86,42.86,beads (pierced objects); spacers,-1388,-1350,"1388-1350 BCE (New Kingdom, Dynasty 18)",Spacer with Cartouche of Amenophis III,H: 7/8 x W: 1/4 x D: 1/16 in. (2.22 x 0.71 x 0...,Egyptian faience with blue and white glaze,...,NaN,NaN,NaN,"CUR_42.86_SideA_DD_RS2009.jpg, CUR_42.86_Rev_D...","EGY, JWL",Ancient Art,To find out whether this object is currently o...,NaN,6182,2513
3,22,48.1367,48.1367,plates,1513,1537,ca. 1525-1530 (Renaissance),Dish with Foliage Design,1 7/8 x 8 9/16 in. (4.7 x 21.7 cm),earthenware with tin glaze (maiolica) and lust...,...,NaN,NaN,NaN,"PL9_48.1367_Fnt_SL.jpg, PL2_48.1367_Back_BW.jpg",REN,Renaissance and Baroque Art,To find out whether this object is currently o...,NaN,33562,NaN
4,35,W.863,W.863,miniatures (paintings),1775,1800,1775-1800,Krishna Steals the Gopis' Clothing,H: 9 13/16 x W: 7 5/16 in. (25 x 18.5 cm); Ima...,opaque watercolor and gold paint on paper,...,NaN,NaN,NaN,PS1_W.863_Fnt_DD_T10.jpg,INT,South and Southeast Asian Art,To find out whether this object is currently o...,NaN,2191,"1983, 2071"

### Select relevant features

In [118]:
# Selected features
collection_features =['CollectionID', 'CollectionName', 'CollDescription', 'NumObjects']
museum_collection = collections[collection_features]
museum_collection.columns

Index(['CollectionID', 'CollectionName', 'CollDescription', 'NumObjects'], dtype='object')

In [119]:
# Selected features 
# these features ('LocationID', 'WaltersArtworks') are foreign keys and should be included in another table for relations
exhibition_features =['ExhibitionID', 'ExhTitle', 
       'ExhibBeginYear', 'ExhibEndYear']
museum_exhibition = exhibitions[exhibition_features]
museum_exhibition.columns

Index(['ExhibitionID', 'ExhTitle', 'ExhibBeginYear', 'ExhibEndYear'], dtype='object')

In [120]:
# Selected features 
# this feature ('CreatorArt') is a foreign key and should be included in another table for relations
creator_features =['id', 'name', 'CreatorURL', 'gender', 'date']
museum_creator = creators[creator_features]
museum_creator.columns

Index(['id', 'name', 'CreatorURL', 'gender', 'date'], dtype='object')

In [121]:
# Selected features 
# these features ('CollectionID', 'Creators', 'Exhibitions') are foreign keys and should be included in another table for relations
art_features =['ObjectID', 'ObjectName', 'DateBeginYear',
       'DateEndYear', 'Title', 'Medium', 
       'ResourceURL', 'Description', 'Images']
museum_artwork = artworks[art_features]
museum_artwork.columns

Index(['ObjectID', 'ObjectName', 'DateBeginYear', 'DateEndYear', 'Title',
       'Medium', 'ResourceURL', 'Description', 'Images'],
      dtype='object')

### Extract the many to many relationships

In [122]:
# the many to many relationship between exhibition and artwork
exhibition_artwork_features = ['ObjectID', 'Exhibitions']
museum_artwork_exhibition = artworks[exhibition_artwork_features]
museum_artwork_exhibition.columns

Index(['ObjectID', 'Exhibitions'], dtype='object')

In [123]:
museum_artwork_exhibition.head()

   ObjectID Exhibitions
0         7         NaN
1        11        2513
2        14        2513
3        22         NaN
4        35  1983, 2071

In [124]:
# We only need the artworks that has been in an exhibition, we can drop every row that misses
museum_artwork_exhibition = museum_artwork_exhibition.dropna()
museum_artwork_exhibition.shape

(7236, 2)

In [125]:
# Splitting the values for making a list
museum_artwork_exhibition['Exhibitions'] = museum_artwork_exhibition['Exhibitions'].apply(lambda x: x.split(','))
museum_artwork_exhibition.head()

   ObjectID    Exhibitions
1        11         [2513]
2        14         [2513]
4        35  [1983,  2071]
7        61   [2069,  432]
8        62         [2089]

In [126]:
# Each value should get an own row for normalizing the table of the many to many relation
museum_artwork_exhibition = museum_artwork_exhibition.explode('Exhibitions')
museum_artwork_exhibition.shape

(14182, 2)

In [127]:
# the many to many relationship between creator and artwork
creator_artwork_features = ['ObjectID', 'Creators']
museum_artwork_creator = artworks[creator_artwork_features]
museum_artwork_creator.columns

Index(['ObjectID', 'Creators'], dtype='object')

In [128]:
museum_artwork_creator = museum_artwork_creator.dropna()
museum_artwork_creator['Creators'] = museum_artwork_creator['Creators'].apply(lambda x: x.split(','))
museum_artwork_creator = museum_artwork_creator.explode('Creators')
museum_artwork_creator.shape

(25530, 2)

In [129]:
# the many to many relationship between collection and artwork
collection_artwork_features = ['ObjectID', 'CollectionID']
museum_artwork_collection = artworks[collection_artwork_features]
museum_artwork_collection.columns

Index(['ObjectID', 'CollectionID'], dtype='object')

In [130]:
museum_artwork_collection.CollectionID.value_counts()

EAN              2909
MSS, ISL, MIS    1780
JMA              1331
JPK              1322
REN              1021
                 ...
SAY, ARM            1
BAR, NUM            1
BAR, ROM            1
EGYJWL              1
MIS                 1
Name: CollectionID, Length: 196, dtype: int64

In [131]:
# It is not clear which collection the artwork belongs to because it is referenced by an undefined abbreviation and number of objects
museum_collection.loc[museum_collection.NumObjects == 436]

,CollectionID,CollectionName,CollDescription,NumObjects
3,4,Roman Empire ...,<p>The Walters&rsquo; collection contains one ...,436

In [132]:
museum_artwork_collection = museum_artwork_collection.dropna()
museum_artwork_collection.shape

(17903, 2)

#### Reference as abbreviation

In [133]:
modified_artwork_collection = museum_artwork_collection.copy()
original_artwork_collection = museum_artwork_collection.copy()

In [134]:
# Regular expression is needed to create a valid format for abbreviations
import re
modified_artwork_collection['CollectionID'] = list(modified_artwork_collection['CollectionID'].apply(lambda x: re.findall("[A-Z]{3}", x.upper())))

In [135]:
# The number of abbreviations has to be mapped against the original values
original_artwork_collection['CollectionID'] = original_artwork_collection['CollectionID'].apply(lambda x: re.findall("[A-Z]{3}", x))
original_artwork_collection.head()

   ObjectID CollectionID
0         7        [ROM]
1        11   [EGY, JWL]
2        14   [EGY, JWL]
3        22        [REN]
4        35        [INT]

In [136]:
# The number of objects for each abbreviation is the only mappable relation to the collections themselves
modified_artwork_collection.CollectionID.value_counts()

[EAN]                   2909
[MSS, ISL, MIS]         1781
[JMA]                   1331
[JPK]                   1326
[REN]                   1021
                        ...
[JWL, ETH]                 1
[EAN, INT]                 1
[CHN, ISL]                 1
[MSS, IIS, MIS, INT]       1
[MIS]                      1
Name: CollectionID, Length: 191, dtype: int64

In [137]:
abbreviation_artwork_collection = original_artwork_collection.loc[original_artwork_collection['CollectionID'].map(len) == 1]
abbreviation_artwork_collection.shape

(12456, 2)

In [138]:
abbreviations_count = pd.DataFrame(abbreviation_artwork_collection.CollectionID.value_counts().reset_index().values, columns=['Abbreviation', 'Count'])
abbreviations_count.columns

Index(['Abbreviation', 'Count'], dtype='object')

In [139]:
abbreviations_count['Count'] = abbreviations_count['Count'].apply(lambda x: int(x))
abbreviations_count

   Abbreviation  Count
0         [EAN]   2909
1         [JMA]   1331
2         [JPK]   1322
3         [REN]   1021
4         [EGY]    863
5         [CHN]    800
6         [MSS]    726
7         [AME]    528
8         [BAR]    479
9         [ROM]    436
10        [MED]    360
11        [GRC]    360
12        [INT]    275
13        [SEA]    264
14        [BYZ]    243
15        [ANE]    237
16        [ISL]    166
17        [SAY]     62
18        [ETH]     46
19        [ARM]     16
20        [JWL]     10
21        [PRE]      1
22        [MIS]      1

In [140]:
museum_collection.sort_values(by=['NumObjects'], ascending=False)

,CollectionID,CollectionName,CollDescription,NumObjects
22,24,18th and 19th Centuries ...,<p>The Walters&rsquo; collection presents an o...,2909
8,10,Japanese Military Armor,<p>Most of the Japanese military objects Willi...,1331
9,11,Japan and Korea ...,NaN,1322
4,5,Renaissance Europe ...,<p>The Walters' collection of European Renaiss...,1021
20,22,Ancient Egypt and Nubia ...,"<p>Statuary, reliefs, stelae, funerary objects...",863
14,16,China ...,<p>The Walters Art Museum&rsquo;s collection o...,800
6,8,Manuscripts and Rare Books,"<p>With more than 900 illuminated manuscripts,...",726
21,23,Ancient Americas ...,"<p>In 1911, Henry Walters purchased almost 100...",528
16,18,Baroque Europe ...,<p>The Baroque was a highly ornamented style c...,479
3,4,Roman Empire ...,<p>The Walters&rsquo; collection contains one ...,436
5,7,Medieval Europe ...,"<p class=""p1"">The period known as the Middle A...",360
19,21,Ancient Greece ...,<p>The Walters' outstanding collection of anci...,360
12,14,"India, Nepal, and Tibet",NaN,275
1,2,Southeast Asia ...,NaN,264
15,17,Byzantium and Early Russia,<p>The Walters Art Museum holds one of the lea...,243
18,20,Ancient Near East ...,NaN,237
10,12,Islamic World ...,<p>The term &ldquo;Islamic art&rdquo; encompas...,166
2,3,South Arabia,NaN,62
13,15,Ethiopia,"<p>The Walters' collection of Ethiopian icons,...",46
17,19,Arms and Armor ...,<p>The Walters' collection of armor and weapon...,16
7,9,Jewelry,<p>The array of exquisite jewelry at the Walte...,10
11,13,Islamic Manuscripts,<p>The Walters&rsquo; collection of Islamic Ma...,1
0,1,Textiles and Furniture ...,NaN,0

In [141]:
abbreviations = []
for index, row in abbreviations_count.iterrows():
    abbreviation_id = museum_collection.loc[museum_collection['NumObjects'] == row['Count']].CollectionID.values[0]
    abbreviations.append(abbreviation_id)

In [142]:
abbreviations_count['CollectionID'] = abbreviations

In [143]:
# The abbreviations MED & GRC as well as PRE & MIS has the same number of objects and could therefore not be distinguished
abbreviations_count

   Abbreviation  Count  CollectionID
0         [EAN]   2909            24
1         [JMA]   1331            10
2         [JPK]   1322            11
3         [REN]   1021             5
4         [EGY]    863            22
5         [CHN]    800            16
6         [MSS]    726             8
7         [AME]    528            23
8         [BAR]    479            18
9         [ROM]    436             4
10        [MED]    360             7
11        [GRC]    360             7
12        [INT]    275            14
13        [SEA]    264             2
14        [BYZ]    243            17
15        [ANE]    237            20
16        [ISL]    166            12
17        [SAY]     62             3
18        [ETH]     46            15
19        [ARM]     16            19
20        [JWL]     10             9
21        [PRE]      1            13
22        [MIS]      1            13

In [144]:
# Each value should get an own row for normalizing the table of the many to many relation
museum_artwork_collection = modified_artwork_collection.explode('CollectionID')
museum_artwork_collection.CollectionID.value_counts()

MSS    4806
EAN    3112
ISL    2589
MIS    2347
REN    1665
MED    1632
JPK    1355
JMA    1331
EGY    1070
CHN     820
ROM     813
JWL     798
GRC     579
BAR     575
BYZ     551
AME     534
INT     459
ANE     281
SEA     269
ETH     129
ARM     116
SAY      88
TAF      67
NUM      30
PRE      12
JEL       1
IIS       1
IAL       1
ISM       1
Name: CollectionID, dtype: int64

In [145]:
abbreviations_collection = abbreviations_count[['CollectionID', 'Abbreviation']].explode('Abbreviation')
abbreviations_collection

    CollectionID Abbreviation
0             24          EAN
1             10          JMA
2             11          JPK
3              5          REN
4             22          EGY
5             16          CHN
6              8          MSS
7             23          AME
8             18          BAR
9              4          ROM
10             7          MED
11             7          GRC
12            14          INT
13             2          SEA
14            17          BYZ
15            20          ANE
16            12          ISL
17             3          SAY
18            15          ETH
19            19          ARM
20             9          JWL
21            13          PRE
22            13          MIS

In [146]:
# Replace the abbreviations by ther id
museum_artwork_collection['CollectionID'] = museum_artwork_collection['CollectionID'].replace(abbreviations_collection.set_index('Abbreviation')['CollectionID'])

### Change data types

In [147]:
# Separate the origin of the creator (the date feature)
museum_creator.date.value_counts() 
# the date don't seem to be consistent and the creators active period may be redundant to the dates of the artworks
# we can use the nationality

 (Japanese)                          137
 (Japanese, Japanese)                 67
 (French)                             33
 (Japanese, 19th century)             23
 (Italian)                            23
                                    ...
 (French, active 1497-1521)            1
 (French, 1819-1916)                   1
 (American, 1823-1894)                 1
 (Japanese, active ca. 1600-1750)      1
 (Yemeni, active ca. 1757)             1
Name: date, Length: 2487, dtype: int64

In [148]:
# Make a table containing the data with correct names and data types
creators = pd.DataFrame({'id': museum_creator.id, 'name': museum_creator.name.astype(str), 'url': museum_creator.CreatorURL.astype(str), 'gender': museum_creator['gender'].astype('category'), 'nationality': museum_creator.fillna("").loc[:, 'date'].apply(lambda x: str(x).replace('(', '').replace(')', '').split(',')).str[0].astype('category')})
creators.head()

,id,name,url,gender,nationality
0,6741,Riza 'Abbasi,https://art.thewalters.org/browse/creator/riza...,NaN,Persian
1,4237,Shaykh 'Abbasi,https://art.thewalters.org/browse/creator/shay...,NaN,Persian
2,19270,Abu Mansur Muhammad ibn 'Abd al-Razzaq,https://art.thewalters.org/browse/creator/abu-...,NaN,
3,19395,'Ali,https://art.thewalters.org/browse/creator/ali,NaN,
4,16856,Sultan 'Ali,https://art.thewalters.org/browse/creator/sult...,NaN,

In [149]:
museum_artwork.columns

Index(['ObjectID', 'ObjectName', 'DateBeginYear', 'DateEndYear', 'Title',
       'Medium', 'ResourceURL', 'Description', 'Images'],
      dtype='object')

In [150]:
artworks = pd.DataFrame({'id': museum_artwork.ObjectID, 'type': museum_artwork.ObjectName.astype('category'), 'date_begin_year': museum_artwork.DateBeginYear.astype('int64'), 'date_end_year': museum_artwork.DateEndYear.astype('int64'), 'title': museum_artwork.Title.astype('category'), 'medium': museum_artwork.Medium.astype('category'), 'url': museum_artwork.ResourceURL.astype(str), 'description': museum_artwork.Description.astype(str)})
artworks.dtypes

id                    int64
type               category
date_begin_year       int64
date_end_year         int64
title              category
medium             category
url                  object
description          object
dtype: object

In [151]:
artworks.head()

,id,type,date_begin_year,date_end_year,title,medium,url,description
0,7,statuettes (statues),-425,-400,Zeus,bronze,https://art.thewalters.org/detail/7,<p>The god is nude except for a mantle draped ...
1,11,finger rings; beads; plaques (flat objects),-1479,-1185,Unfinished Ring with Flat Bead,carved yellow jasper and gold,https://art.thewalters.org/detail/11,<p>One side of the bead bears a detailed carvi...
2,14,beads (pierced objects); spacers,-1388,-1350,Spacer with Cartouche of Amenophis III,Egyptian faience with blue and white glaze,https://art.thewalters.org/detail/14,<p>This piece is a faience spacer bead with th...
3,22,plates,1513,1537,Dish with Foliage Design,earthenware with tin glaze (maiolica) and lust...,https://art.thewalters.org/detail/22,<p>The center of this dish shows a serrated re...
4,35,miniatures (paintings),1775,1800,Krishna Steals the Gopis' Clothing,opaque watercolor and gold paint on paper,https://art.thewalters.org/detail/35,<p>In a popular episode from Krishna’s life st...

In [152]:
museum_collection.columns

Index(['CollectionID', 'CollectionName', 'CollDescription', 'NumObjects'], dtype='object')

In [153]:
collections = pd.DataFrame({'id': museum_collection.CollectionID, 'name': museum_collection.CollectionName.astype('category'), 'description': museum_collection.CollDescription.fillna("").astype(str)})
collections.dtypes

id                int64
name           category
description      object
dtype: object

In [154]:
collections.head()

,id,name,description
0,1,Textiles and Furniture ...,
1,2,Southeast Asia ...,
2,3,South Arabia,
3,4,Roman Empire ...,<p>The Walters&rsquo; collection contains one ...
4,5,Renaissance Europe ...,<p>The Walters' collection of European Renaiss...

In [155]:
museum_exhibition.columns

Index(['ExhibitionID', 'ExhTitle', 'ExhibBeginYear', 'ExhibEndYear'], dtype='object')

In [156]:
exhibitions = pd.DataFrame({'id': museum_exhibition.ExhibitionID, 'name': museum_exhibition.ExhTitle, 'begin_year': museum_exhibition.ExhibBeginYear.astype('int64')})
exhibitions.dtypes

id             int64
name          object
begin_year     int64
dtype: object

In [157]:
exhibitions.head()

     id                                               name  begin_year
0  3628                            Léon Bonvin (1834-1866)        2022
1  3696  Sargent, Whistler, and Venetian Glass: America...        2021
2  3735                                  Hugo van der Goes        2021
3  3786       Quiet Beauty: The Watercolors of Léon Bonvin        2023
4  3581  Caravans of Gold, Fragments in Time: Art, Cult...        2019

In [158]:
museum_artwork_creator = pd.DataFrame({'artwork_id': museum_artwork_creator.ObjectID, 'creator_id': museum_artwork_creator.Creators.astype('int64')})

In [159]:
museum_artwork_exhibition = pd.DataFrame({'artwork_id': museum_artwork_exhibition.ObjectID, 'exhibition_id': museum_artwork_exhibition.Exhibitions.astype('int64')})

In [160]:
museum_artwork_collection.dropna(inplace=True)

In [161]:
museum_artwork_collection.CollectionID = museum_artwork_collection.CollectionID.astype(str)

In [162]:
museum_artwork_collection = museum_artwork_collection.loc[museum_artwork_collection.CollectionID.str.isnumeric()]

In [163]:
museum_artwork_collection = pd.DataFrame({'artwork_id': museum_artwork_collection.ObjectID, 'collection_id': museum_artwork_collection.CollectionID.astype('int64')})

## Select data for the algorithm

In [164]:
selected_creators = pd.read_csv('selectedcreators.csv', sep=";", encoding="utf-8")
selected_creators.head()

,Unnamed: 0,creator_id,sort_name,name,creator_gender,creator_nationality,CreatorArtwork
0,NaN,1889,"Taylor, Eleanor",Eleanor Taylor,female,English,32540
1,NaN,1903,"Peeters, Isabella",Isabella Peeters,female,Flemish,"13532, 21111"
2,NaN,2132,"Sharples, Ellen",Ellen Sharples,female,English,10117
3,NaN,3073,"Bateman, Hester",Hester Bateman,female,English,8495
4,NaN,3209,"Hall, Anne",Anne Hall,female,American,5863

In [165]:
selected_creators.creator_id = selected_creators.creator_id.astype('int64')

In [166]:
creators = creators.loc[creators.id.isin(selected_creators.creator_id)]
creators.head()

,id,name,url,gender,nationality
25,7870,Katherine Adams,https://art.thewalters.org/browse/creator/kath...,female,
27,8127,Mariia V. Adler,https://art.thewalters.org/browse/creator/mari...,female,Russian
92,5485,Sofonisba Anguissola,https://art.thewalters.org/browse/creator/sofo...,female,Italian
107,5934,José Jiménez Aranda,https://art.thewalters.org/browse/creator/josc...,male,Spanish
173,6727,Gerardina Jacoba van de Sande Bakhuyzen,https://art.thewalters.org/browse/creator/gera...,female,Dutch

In [167]:
creators.shape

(74, 5)

In [168]:
museum_artwork_creator.dtypes

artwork_id    int64
creator_id    int64
dtype: object

In [169]:
museum_artwork_creator = museum_artwork_creator.loc[museum_artwork_creator.creator_id.isin(selected_creators.creator_id)]
museum_artwork_creator.head()

     artwork_id  creator_id
115         575        3533
229        1196        4570
261        1327        4493
273        1377        5485
540        2659        6011

In [170]:
museum_artwork_creator.shape

(604, 2)

In [171]:
artworks = artworks.loc[artworks.id.isin(museum_artwork_creator.artwork_id)]
artworks.head()

,id,type,date_begin_year,date_end_year,title,medium,url,description
115,575,oil paintings (visual works); panel paintings,1801,1900,The Important Response,oil on panel,https://art.thewalters.org/detail/575,<p>A lady in early 17th-century attire is seat...
229,1196,plaques,1588,1612,Oval Plaque with the Annunciation,painted enamel and gilding on copper,https://art.thewalters.org/detail/1196,"<p>Monogrammed ""S. C."" in gold letters near th..."
261,1327,boxes (containers),1900,1917,Oval Box with Monogram of Nicholas II,"nephrite, gold (56 zolotnik), diamonds, enamel",https://art.thewalters.org/detail/1327,<p>This nephrite box is decorated with the mon...
273,1377,portraits; oil paintings,1557,1557,Portrait of Marquess Massimiliano Stampa,oil on canvas,https://art.thewalters.org/detail/1377,<p>The boy can be identified as the nine-year-...
540,2659,plates,1924,1930,Plate Showing Imps on a Bridge and Tree House,lusterware,https://art.thewalters.org/detail/2659,<p>The Wedgwood factory gave Susannah Margaret...

In [172]:
artworks.shape

(597, 8)

In [173]:
museum_artwork_collection = museum_artwork_collection.loc[museum_artwork_collection.artwork_id.isin(artworks.id)]
museum_artwork_collection.head()

     artwork_id  collection_id
115         575             24
229        1196             18
261        1327             24
273        1377              5
540        2659             24

In [174]:
museum_artwork_collection.shape

(1454, 2)

In [175]:
museum_artwork_exhibition = museum_artwork_exhibition.loc[museum_artwork_exhibition.artwork_id.isin(artworks.id)]
museum_artwork_exhibition.head()

     artwork_id  exhibition_id
115         575           2674
229        1196           2299
261        1327           2062
261        1327           2689
261        1327           2819

In [176]:
museum_artwork_exhibition.shape

(262, 2)

In [177]:
# the entities
creators.to_csv(index=False, path_or_buf='curateddata/Creators.csv')
artworks.to_csv(index=False, path_or_buf='curateddata/Artworks.csv')
collections.to_csv(index=False, path_or_buf='curateddata/Collections.csv')
exhibitions.to_csv(index=False, path_or_buf='curateddata/Exhibitions.csv')

In [178]:
# the many to many relations
museum_artwork_creator.to_csv(index=False, path_or_buf='curateddata/ArtworkCreator.csv')
museum_artwork_exhibition.to_csv(index=False, path_or_buf='curateddata/ArtworkExhibition.csv')
museum_artwork_collection.to_csv(index=False, path_or_buf='curateddata/ArtworkCollection.csv')

In [179]:
test = pd.read_csv('curateddata/ArtworkCreator.csv', sep=",", encoding="utf-8")
test.shape

(604, 2)